In [1]:
import pandas as pd
import numpy as np

In [2]:
path = r"C:\Users\Dang\Desktop\Python4ML_UIT\Lab_11\data\Social_Network_Ads.csv"

In [3]:
df = pd.read_csv(path)
df

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [8]:
ndf = pd.DataFrame(df.groupby("Purchased").count())

In [9]:
ndf

           Age  EstimatedSalary
Purchased
0          257              257
1          143              143

In [10]:
print(ndf.iloc[0]["Age"]/(ndf.iloc[0]["Age"]+ndf.iloc[1]["Age"]))

0.6425